SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USB_Custom_HID/MM32F5370_HID_Bootloader/Device/MM32F5370/Include/reg_qspi.h
/**
  * @brief QSPI_IABR Register Bit Definition
  */
#define  QSPI_IABR_IALT_Pos                       (0)
#define  QSPI_IABR_IALT_Msk                       (0xFFFFFFFFU << QSPI_IABR_IALT_Pos)               /*!<*/
#define  QSPI_IABR_IALT                           QSPI_IABR_IALT_Msk
#define  QSPI_IABR_IALT_Bit0                      (0x00000001U << QSPI_IABR_IALT_Pos) 
#define  QSPI_IABR_IALT_Bit1                      (0x00000002U << QSPI_IABR_IALT_Pos) 
#define  QSPI_IABR_IALT_Bit2                      (0x00000004U << QSPI_IABR_IALT_Pos) 
#define  QSPI_IABR_IALT_Bit3                      (0x00000008U << QSPI_IABR_IALT_Pos) 
#define  QSPI_IABR_IALT_Bit4                      (0x00000010U << QSPI_IABR_IALT_Pos) 
#define  QSPI_IABR_IALT_Bit5                      (0x00000020U << QSPI_IABR_IALT_Pos) 
#define  QSPI_IABR_IALT_Bit6                      (0x00000040U << QSPI_IABR_IALT_Pos) 
#define  QSPI_IABR_IALT_Bit7                      (0x00000080U << QSPI_IABR_IALT_Pos) 
#define  QSPI_IABR_IALT_Bit8                      (0x00000100U << QSPI_IABR_IALT_Pos) 
#define  QSPI_IABR_IALT_Bit9                      (0x00000200U << QSPI_IABR_IALT_Pos) 
#define  QSPI_IABR_IALT_Bit10                     (0x00000400U << QSPI_IABR_IALT_Pos) 
#define  QSPI_IABR_IALT_Bit11                     (0x00000800U << QSPI_IABR_IALT_Pos) 
#define  QSPI_IABR_IALT_Bit12                     (0x00001000U << QSPI_IABR_IALT_Pos) 
#define  QSPI_IABR_IALT_Bit13                     (0x00002000U << QSPI_IABR_IALT_Pos) 
#define  QSPI_IABR_IALT_Bit14                     (0x00004000U << QSPI_IABR_IALT_Pos) 
#define  QSPI_IABR_IALT_Bit15                     (0x00008000U << QSPI_IABR_IALT_Pos) 
#define  QSPI_IABR_IALT_Bit16                     (0x00010000U << QSPI_IABR_IALT_Pos) 
#define  QSPI_IABR_IALT_Bit17                     (0x00020000U << QSPI_IABR_IALT_Pos) 
#define  QSPI_IABR_IALT_Bit18                     (0x00040000U << QSPI_IABR_IALT_Pos) 
#define  QSPI_IABR_IALT_Bit19                     (0x00080000U << QSPI_IABR_IALT_Pos) 
#define  QSPI_IABR_IALT_Bit20                     (0x00100000U << QSPI_IABR_IALT_Pos) 
#define  QSPI_IABR_IALT_Bit21                     (0x00200000U << QSPI_IABR_IALT_Pos) 
#define  QSPI_IABR_IALT_Bit22                     (0x00400000U << QSPI_IABR_IALT_Pos) 
#define  QSPI_IABR_IALT_Bit23                     (0x00800000U << QSPI_IABR_IALT_Pos) 
#define  QSPI_IABR_IALT_Bit24                     (0x01000000U << QSPI_IABR_IALT_Pos) 
#define  QSPI_IABR_IALT_Bit25                     (0x02000000U << QSPI_IABR_IALT_Pos) 
#define  QSPI_IABR_IALT_Bit26                     (0x04000000U << QSPI_IABR_IALT_Pos) 
#define  QSPI_IABR_IALT_Bit27                     (0x08000000U << QSPI_IABR_IALT_Pos) 
#define  QSPI_IABR_IALT_Bit28                     (0x10000000U << QSPI_IABR_IALT_Pos) 
#define  QSPI_IABR_IALT_Bit29                     (0x20000000U << QSPI_IABR_IALT_Pos) 
#define  QSPI_IABR_IALT_Bit30                     (0x40000000U << QSPI_IABR_IALT_Pos) 
#define  QSPI_IABR_IALT_Bit31                     (0x80000000U << QSPI_IABR_IALT_Pos) 

/**
  * @brief QSPI_IADR Register Bit Definition
  */
#define  QSPI_IADR_IADDR_Pos                      (0)
#define  QSPI_IADR_IADDR_Msk                      (0xFFFFFFFFU << QSPI_IADR_IADDR_Pos)              /*!<*/
#define  QSPI_IADR_IADDR                          QSPI_IADR_IADDR_Msk
#define  QSPI_IADR_IADDR_Bit0                     (0x00000001U << QSPI_IADR_IADDR_Pos) 
#define  QSPI_IADR_IADDR_Bit1                     (0x00000002U << QSPI_IADR_IADDR_Pos) 
#define  QSPI_IADR_IADDR_Bit2                     (0x00000004U << QSPI_IADR_IADDR_Pos) 
#define  QSPI_IADR_IADDR_Bit3                     (0x00000008U << QSPI_IADR_IADDR_Pos) 
#define  QSPI_IADR_IADDR_Bit4                     (0x00000010U << QSPI_IADR_IADDR_Pos) 
#define  QSPI_IADR_IADDR_Bit5                     (0x00000020U << QSPI_IADR_IADDR_Pos) 
#define  QSPI_IADR_IADDR_Bit6                     (0x00000040U << QSPI_IADR_IADDR_Pos) 
#define  QSPI_IADR_IADDR_Bit7                     (0x00000080U << QSPI_IADR_IADDR_Pos) 
#define  QSPI_IADR_IADDR_Bit8                     (0x00000100U << QSPI_IADR_IADDR_Pos) 
#define  QSPI_IADR_IADDR_Bit9                     (0x00000200U << QSPI_IADR_IADDR_Pos) 
#define  QSPI_IADR_IADDR_Bit10                    (0x00000400U << QSPI_IADR_IADDR_Pos) 
#define  QSPI_IADR_IADDR_Bit11                    (0x00000800U << QSPI_IADR_IADDR_Pos) 
#define  QSPI_IADR_IADDR_Bit12                    (0x00001000U << QSPI_IADR_IADDR_Pos) 
#define  QSPI_IADR_IADDR_Bit13                    (0x00002000U << QSPI_IADR_IADDR_Pos) 
#define  QSPI_IADR_IADDR_Bit14                    (0x00004000U << QSPI_IADR_IADDR_Pos) 
#define  QSPI_IADR_IADDR_Bit15                    (0x00008000U << QSPI_IADR_IADDR_Pos) 
#define  QSPI_IADR_IADDR_Bit16                    (0x00010000U << QSPI_IADR_IADDR_Pos) 
#define  QSPI_IADR_IADDR_Bit17                    (0x00020000U << QSPI_IADR_IADDR_Pos) 
#define  QSPI_IADR_IADDR_Bit18                    (0x00040000U << QSPI_IADR_IADDR_Pos) 
#define  QSPI_IADR_IADDR_Bit19                    (0x00080000U << QSPI_IADR_IADDR_Pos) 
#define  QSPI_IADR_IADDR_Bit20                    (0x00100000U << QSPI_IADR_IADDR_Pos) 
#define  QSPI_IADR_IADDR_Bit21                    (0x00200000U << QSPI_IADR_IADDR_Pos) 
#define  QSPI_IADR_IADDR_Bit22                    (0x00400000U << QSPI_IADR_IADDR_Pos) 
#define  QSPI_IADR_IADDR_Bit23                    (0x00800000U << QSPI_IADR_IADDR_Pos) 
#define  QSPI_IADR_IADDR_Bit24                    (0x01000000U << QSPI_IADR_IADDR_Pos) 
#define  QSPI_IADR_IADDR_Bit25                    (0x02000000U << QSPI_IADR_IADDR_Pos) 
#define  QSPI_IADR_IADDR_Bit26                    (0x04000000U << QSPI_IADR_IADDR_Pos) 
#define  QSPI_IADR_IADDR_Bit27                    (0x08000000U << QSPI_IADR_IADDR_Pos) 
#define  QSPI_IADR_IADDR_Bit28                    (0x10000000U << QSPI_IADR_IADDR_Pos) 
#define  QSPI_IADR_IADDR_Bit29                    (0x20000000U << QSPI_IADR_IADDR_Pos) 
#define  QSPI_IADR_IADDR_Bit30                    (0x40000000U << QSPI_IADR_IADDR_Pos) 
#define  QSPI_IADR_IADDR_Bit31                    (0x80000000U << QSPI_IADR_IADDR_Pos) 

/**
  * @brief QSPI_IDFR Register Bit Definition
  */
#define  QSPI_IDFR_IDATA_Pos                      (0)
#define  QSPI_IDFR_IDATA_Msk                      (0xFFFFFFFFU << QSPI_IDFR_IDATA_Pos)              /*!<*/
#define  QSPI_IDFR_IDATA                          QSPI_IDFR_IDATA_Msk
#define  QSPI_IDFR_IDATA_Bit0                     (0x00000001U << QSPI_IDFR_IDATA_Pos) 
#define  QSPI_IDFR_IDATA_Bit1                     (0x00000002U << QSPI_IDFR_IDATA_Pos) 
#define  QSPI_IDFR_IDATA_Bit2                     (0x00000004U << QSPI_IDFR_IDATA_Pos) 
#define  QSPI_IDFR_IDATA_Bit3                     (0x00000008U << QSPI_IDFR_IDATA_Pos) 
#define  QSPI_IDFR_IDATA_Bit4                     (0x00000010U << QSPI_IDFR_IDATA_Pos) 
#define  QSPI_IDFR_IDATA_Bit5                     (0x00000020U << QSPI_IDFR_IDATA_Pos) 
#define  QSPI_IDFR_IDATA_Bit6                     (0x00000040U << QSPI_IDFR_IDATA_Pos) 
#define  QSPI_IDFR_IDATA_Bit7                     (0x00000080U << QSPI_IDFR_IDATA_Pos) 
#define  QSPI_IDFR_IDATA_Bit8                     (0x00000100U << QSPI_IDFR_IDATA_Pos) 
#define  QSPI_IDFR_IDATA_Bit9                     (0x00000200U << QSPI_IDFR_IDATA_Pos) 
#define  QSPI_IDFR_IDATA_Bit10                    (0x00000400U << QSPI_IDFR_IDATA_Pos) 
#define  QSPI_IDFR_IDATA_Bit11                    (0x00000800U << QSPI_IDFR_IDATA_Pos) 
#define  QSPI_IDFR_IDATA_Bit12                    (0x00001000U << QSPI_IDFR_IDATA_Pos) 
#define  QSPI_IDFR_IDATA_Bit13                    (0x00002000U << QSPI_IDFR_IDATA_Pos) 
#define  QSPI_IDFR_IDATA_Bit14                    (0x00004000U << QSPI_IDFR_IDATA_Pos) 
#define  QSPI_IDFR_IDATA_Bit15                    (0x00008000U << QSPI_IDFR_IDATA_Pos) 
#define  QSPI_IDFR_IDATA_Bit16                    (0x00010000U << QSPI_IDFR_IDATA_Pos) 
#define  QSPI_IDFR_IDATA_Bit17                    (0x00020000U << QSPI_IDFR_IDATA_Pos) 
#define  QSPI_IDFR_IDATA_Bit18                    (0x00040000U << QSPI_IDFR_IDATA_Pos) 
#define  QSPI_IDFR_IDATA_Bit19                    (0x00080000U << QSPI_IDFR_IDATA_Pos) 
#define  QSPI_IDFR_IDATA_Bit20                    (0x00100000U << QSPI_IDFR_IDATA_Pos) 
#define  QSPI_IDFR_IDATA_Bit21                    (0x00200000U << QSPI_IDFR_IDATA_Pos) 
#define  QSPI_IDFR_IDATA_Bit22                    (0x00400000U << QSPI_IDFR_IDATA_Pos) 
#define  QSPI_IDFR_IDATA_Bit23                    (0x00800000U << QSPI_IDFR_IDATA_Pos) 
#define  QSPI_IDFR_IDATA_Bit24                    (0x01000000U << QSPI_IDFR_IDATA_Pos) 
#define  QSPI_IDFR_IDATA_Bit25                    (0x02000000U << QSPI_IDFR_IDATA_Pos) 
#define  QSPI_IDFR_IDATA_Bit26                    (0x04000000U << QSPI_IDFR_IDATA_Pos) 
#define  QSPI_IDFR_IDATA_Bit27                    (0x08000000U << QSPI_IDFR_IDATA_Pos) 
#define  QSPI_IDFR_IDATA_Bit28                    (0x10000000U << QSPI_IDFR_IDATA_Pos) 
#define  QSPI_IDFR_IDATA_Bit29                    (0x20000000U << QSPI_IDFR_IDATA_Pos) 
#define  QSPI_IDFR_IDATA_Bit30                    (0x40000000U << QSPI_IDFR_IDATA_Pos) 
#define  QSPI_IDFR_IDATA_Bit31                    (0x80000000U << QSPI_IDFR_IDATA_Pos) 

/**
  * @brief QSPI_IDLR Register Bit Definition
  */
#define  QSPI_IDLR_IDLEN_Pos                      (0)
#define  QSPI_IDLR_IDLEN_Msk                      (0xFFFFFU << QSPI_IDLR_IDLEN_Pos)                 /*!<*/
#define  QSPI_IDLR_IDLEN                          QSPI_IDLR_IDLEN_Msk
#define  QSPI_IDLR_IDLEN_Bit0                     (0x00001U << QSPI_IDLR_IDLEN_Pos) 
#define  QSPI_IDLR_IDLEN_Bit1                     (0x00002U << QSPI_IDLR_IDLEN_Pos) 
#define  QSPI_IDLR_IDLEN_Bit2                     (0x00004U << QSPI_IDLR_IDLEN_Pos) 
#define  QSPI_IDLR_IDLEN_Bit3                     (0x00008U << QSPI_IDLR_IDLEN_Pos) 
#define  QSPI_IDLR_IDLEN_Bit4                     (0x00010U << QSPI_IDLR_IDLEN_Pos) 
#define  QSPI_IDLR_IDLEN_Bit5                     (0x00020U << QSPI_IDLR_IDLEN_Pos) 
#define  QSPI_IDLR_IDLEN_Bit6                     (0x00040U << QSPI_IDLR_IDLEN_Pos) 
#define  QSPI_IDLR_IDLEN_Bit7                     (0x00080U << QSPI_IDLR_IDLEN_Pos) 
#define  QSPI_IDLR_IDLEN_Bit8                     (0x00100U << QSPI_IDLR_IDLEN_Pos) 
#define  QSPI_IDLR_IDLEN_Bit9                     (0x00200U << QSPI_IDLR_IDLEN_Pos) 
#define  QSPI_IDLR_IDLEN_Bit10                    (0x00400U << QSPI_IDLR_IDLEN_Pos) 
#define  QSPI_IDLR_IDLEN_Bit11                    (0x00800U << QSPI_IDLR_IDLEN_Pos) 
#define  QSPI_IDLR_IDLEN_Bit12                    (0x01000U << QSPI_IDLR_IDLEN_Pos) 
#define  QSPI_IDLR_IDLEN_Bit13                    (0x02000U << QSPI_IDLR_IDLEN_Pos) 
#define  QSPI_IDLR_IDLEN_Bit14                    (0x04000U << QSPI_IDLR_IDLEN_Pos) 
#define  QSPI_IDLR_IDLEN_Bit15                    (0x08000U << QSPI_IDLR_IDLEN_Pos) 
#define  QSPI_IDLR_IDLEN_Bit16                    (0x10000U << QSPI_IDLR_IDLEN_Pos) 
#define  QSPI_IDLR_IDLEN_Bit17                    (0x20000U << QSPI_IDLR_IDLEN_Pos) 
#define  QSPI_IDLR_IDLEN_Bit18                    (0x40000U << QSPI_IDLR_IDLEN_Pos) 
#define  QSPI_IDLR_IDLEN_Bit19                    (0x80000U << QSPI_IDLR_IDLEN_Pos) 

/**
  * @brief QSPI_IWCR Register Bit Definition
  */
#define  QSPI_IWCR_IWCNT_Pos                      (0)
#define  QSPI_IWCR_IWCNT_Msk                      (0x3FFFFFFFU << QSPI_IWCR_IWCNT_Pos)              /*!<*/
#define  QSPI_IWCR_IWCNT                          QSPI_IWCR_IWCNT_Msk
#define  QSPI_IWCR_IWCNT_Bit0                     (0x00000001U << QSPI_IWCR_IWCNT_Pos) 
#define  QSPI_IWCR_IWCNT_Bit1                     (0x00000002U << QSPI_IWCR_IWCNT_Pos) 
#define  QSPI_IWCR_IWCNT_Bit2                     (0x00000004U << QSPI_IWCR_IWCNT_Pos) 
#define  QSPI_IWCR_IWCNT_Bit3                     (0x00000008U << QSPI_IWCR_IWCNT_Pos) 
#define  QSPI_IWCR_IWCNT_Bit4                     (0x00000010U << QSPI_IWCR_IWCNT_Pos) 
#define  QSPI_IWCR_IWCNT_Bit5                     (0x00000020U << QSPI_IWCR_IWCNT_Pos) 
#define  QSPI_IWCR_IWCNT_Bit6                     (0x00000040U << QSPI_IWCR_IWCNT_Pos) 
#define  QSPI_IWCR_IWCNT_Bit7                     (0x00000080U << QSPI_IWCR_IWCNT_Pos) 
#define  QSPI_IWCR_IWCNT_Bit8                     (0x00000100U << QSPI_IWCR_IWCNT_Pos) 
#define  QSPI_IWCR_IWCNT_Bit9                     (0x00000200U << QSPI_IWCR_IWCNT_Pos) 
#define  QSPI_IWCR_IWCNT_Bit10                    (0x00000400U << QSPI_IWCR_IWCNT_Pos) 
#define  QSPI_IWCR_IWCNT_Bit11                    (0x00000800U << QSPI_IWCR_IWCNT_Pos) 
#define  QSPI_IWCR_IWCNT_Bit12                    (0x00001000U << QSPI_IWCR_IWCNT_Pos) 
#define  QSPI_IWCR_IWCNT_Bit13                    (0x00002000U << QSPI_IWCR_IWCNT_Pos) 
#define  QSPI_IWCR_IWCNT_Bit14                    (0x00004000U << QSPI_IWCR_IWCNT_Pos) 
#define  QSPI_IWCR_IWCNT_Bit15                    (0x00008000U << QSPI_IWCR_IWCNT_Pos) 
#define  QSPI_IWCR_IWCNT_Bit16                    (0x00010000U << QSPI_IWCR_IWCNT_Pos) 
#define  QSPI_IWCR_IWCNT_Bit17                    (0x00020000U << QSPI_IWCR_IWCNT_Pos) 
#define  QSPI_IWCR_IWCNT_Bit18                    (0x00040000U << QSPI_IWCR_IWCNT_Pos) 
#define  QSPI_IWCR_IWCNT_Bit19                    (0x00080000U << QSPI_IWCR_IWCNT_Pos) 
#define  QSPI_IWCR_IWCNT_Bit20                    (0x00100000U << QSPI_IWCR_IWCNT_Pos) 
#define  QSPI_IWCR_IWCNT_Bit21                    (0x00200000U << QSPI_IWCR_IWCNT_Pos) 
#define  QSPI_IWCR_IWCNT_Bit22                    (0x00400000U << QSPI_IWCR_IWCNT_Pos) 
#define  QSPI_IWCR_IWCNT_Bit23                    (0x00800000U << QSPI_IWCR_IWCNT_Pos) 
#define  QSPI_IWCR_IWCNT_Bit24                    (0x01000000U << QSPI_IWCR_IWCNT_Pos) 
#define  QSPI_IWCR_IWCNT_Bit25                    (0x02000000U << QSPI_IWCR_IWCNT_Pos) 
#define  QSPI_IWCR_IWCNT_Bit26                    (0x04000000U << QSPI_IWCR_IWCNT_Pos) 
#define  QSPI_IWCR_IWCNT_Bit27                    (0x08000000U << QSPI_IWCR_IWCNT_Pos) 
#define  QSPI_IWCR_IWCNT_Bit28                    (0x10000000U << QSPI_IWCR_IWCNT_Pos) 
#define  QSPI_IWCR_IWCNT_Bit29                    (0x20000000U << QSPI_IWCR_IWCNT_Pos) 

/**
  * @brief QSPI_IDER Register Bit Definition
  */
#define  QSPI_IDER_TCFINTEN_Pos                   (0)
#define  QSPI_IDER_TCFINTEN_Msk                   (0x1U << QSPI_IDER_TCFINTEN_Pos)                  /*!<*/
#define  QSPI_IDER_TCFINTEN                       QSPI_IDER_TCFINTEN_Msk
#define  QSPI_IDER_EMPTYINTEN_Pos                 (6)
#define  QSPI_IDER_EMPTYINTEN_Msk                 (0x1U << QSPI_IDER_EMPTYINTEN_Pos)                /*!<*/
#define  QSPI_IDER_EMPTYINTEN                     QSPI_IDER_EMPTYINTEN_Msk
#define  QSPI_IDER_FULLINTEN_Pos                  (7)
#define  QSPI_IDER_FULLINTEN_Msk                  (0x1U << QSPI_IDER_FULLINTEN_Pos)                 /*!<*/
#define  QSPI_IDER_FULLINTEN                      QSPI_IDER_FULLINTEN_Msk
#define  QSPI_IDER_TCFDMAEN_Pos                   (8)
#define  QSPI_IDER_TCFDMAEN_Msk                   (0x1U << QSPI_IDER_TCFDMAEN_Pos)                  /*!<*/
#define  QSPI_IDER_TCFDMAEN                       QSPI_IDER_TCFDMAEN_Msk
#define  QSPI_IDER_EMPTYDMAEN_Pos                 (14)
#define  QSPI_IDER_EMPTYDMAEN_Msk                 (0x1U << QSPI_IDER_EMPTYDMAEN_Pos)                /*!<*/
#define  QSPI_IDER_EMPTYDMAEN                     QSPI_IDER_EMPTYDMAEN_Msk
#define  QSPI_IDER_FULLDMAEN_Pos                  (15)
#define  QSPI_IDER_FULLDMAEN_Msk                  (0x1U << QSPI_IDER_FULLDMAEN_Pos)                 /*!<*/
#define  QSPI_IDER_FULLDMAEN                      QSPI_IDER_FULLDMAEN_Msk


#endif

